src/InformationRegisters/бит_ЯндексЕдаНастройкиСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>бит_ЯндексЕдаНастройкиСтатусов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноОбновление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенаОтмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ЯндексЕдаСтатусы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/бит_ЯндексЕдаСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>бит_ЯндексЕдаСтатусы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NEW</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ACCEPTED_BY_RESTAURANT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COOKING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>READY</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TAKEN_BY_COURIER</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELIVERED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CANCELLED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POSTPONED</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonForms/бит_ЯндексЕдаФормаНастройки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьСтатусыЗаказовНаСервере();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаТЧ Из СтатусыЗаказов Цикл 
		Если СтрокаТЧ.Статус = Перечисления.бит_ЯндексЕдаСтатусы.NEW
			Или СтрокаТЧ.Статус = Перечисления.бит_ЯндексЕдаСтатусы.READY Тогда 
			СтрокаТЧ.Используется = Истина;
		КонецЕсли;
	КонецЦикла;
	
	НабЗап = РегистрыСведений.бит_ЯндексЕдаНастройкиСтатусов.СоздатьНаборЗаписей();
	НабЗап.Загрузить(СтатусыЗаказов.Выгрузить());
	НабЗап.Записать();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьХранилищеТокенов(Команда)
	ОткрытьФорму("РегистрСведений.бит_ХранилищеТокенов.ФормаСписка");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСтатусыЗаказовНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЯндексЕдаСтатусы.Ссылка КАК Статус,
		|	бит_ЯндексЕдаНастройкиСтатусов.Используется КАК Используется,
		|	бит_ЯндексЕдаНастройкиСтатусов.РазрешеноОбновление КАК РазрешеноОбновление,
		|	бит_ЯндексЕдаНастройкиСтатусов.РазрешенаОтмена КАК РазрешенаОтмена
		|ИЗ
		|	Перечисление.бит_ЯндексЕдаСтатусы КАК бит_ЯндексЕдаСтатусы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЯндексЕдаНастройкиСтатусов КАК бит_ЯндексЕдаНастройкиСтатусов
		|		ПО бит_ЯндексЕдаСтатусы.Ссылка = бит_ЯндексЕдаНастройкиСтатусов.Статус
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ЯндексЕдаНастройкиСтатусов.Статус.Порядок";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	СтатусыЗаказов.Загрузить(Выборка);	
	
КонецПроцедуры

#КонецОбласти
